alphastring = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZβ"
alphawide = "ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶⅤＷＸＹＺⅦⅡⅣⅠⅧⅨⅥ"

alphabettrans = str.maketrans("", "", alphastring + alphawide)

hiragana = ("あえいおうかけきこくさしすせそたちつてとなにぬねのはひふへほ"
            "まみむめもやゆよらりるれろわをんがぎぐげござじずぜぞだぢづ"
            "でどばびぶべぼぱぴぷぺぽゃょゅっぁぃぉぅぇゎゝゐ")


katakana = ("アエイオウカケキコクサシスセソタチツテトナニヌネノハヒフヘホ"
            "マミムメモヤユヨラリルレロワヲウンガギグゲゴザジズゼゾダヂヅ"
            "デドバビブベボパピプペポょャュィョェァォッーゥヮヴヵヶ")


specialchars = ['\u3000', '、', '。', '《', '》', '！', '「', '」', '[', ']',
                '&', '-', '/', '\'', '（', '）', '=', '↓', '♯',
                '\"', '?', '◎', '-', '+', '】', '◆', '○', '×', '<', '>',
                '』', '.', '△', '？', '!', '☆', '・', '〇', '『', '…', '｜',
                '～', '【', '―', "…", '">', '="', ' ', '="/.">', '⑰', '㎝', '㎜',
                '◯', '‥', '♥', '*', ';', ':', '{', '}', '#', '%', '●', '■',
                '─', '〝', '〟', '〟', '：', r'\)', r'\(', ',', '／', '］',
                '［', '|', '_', '％', '＜', '＞', 'ω', '＠', '＄',
                '．', '℃', '−', '\xa0', '\r', '※', '→', '＆', '〈', '〉', '＝',
                '｟', '－', '©', '＊', '③', '②', '①', '④', '＋', '†',
                '□', '｝', '〜', '，', '★', '｠', '‥', '〕', '㎝', '◇', '⑰', '♫',
                '㎜', '▽', '←', '＃', '‐', 'Ⅲ', '@', '⑤', '⑥', '♡',
                '〔', '♥', '◆', 'α', 'γ', '÷', '㎞', '±', 'Ⅰ', '♪', '◯']

sentencemarker = ['。',
                  '、',
                  '!',
                  '！',
                  '？',
                  '」',
                  '「',
                  '』',
                  '『',
                  '（',
                  '）',
                  '〝',
                  '〟']

numbers = "0123456789０１２３４５６７８９"


allchars = hiragana + katakana + \
    "".join(specialchars) + alphastring + numbers + alphawide


alltrans = str.maketrans("", "", allchars)


def remove_non_kanji(words):
    wordlist = ''.join(words)
    wordlist = wordlist.translate(alltrans)
    wordlist = wordlist.replace('\n', '')
    return wordlist
